BackwardStep/Backward-Facing_rhoPimpleCentralFoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 7.33;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7.33;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform 7.33;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 7.33;
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
/*
Интенсивность турбулентности ~1%. Для 44.2 м/с с I = 5%: k=1,5×(0,05×44,2)2 ≈7,33
* */
